In [1]:
import pandas as pd
import numpy as np

In [6]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv','Mittal','Archana'], 
        'Marks':[98,np.nan,99,87,np.nan,83,99],
        'Gender':['Male','Female','Female','Male','Male','Female','Female'],
        'Email':['Priyang@gmail.com','Aadhya@gmail.com','Krisha@gmail.com',
                 'Vedant@yahoo.com','Parshv@hotmail.com','Mittal@yahoo.com','Archana@yahoo.com']}

In [15]:
# To create a data frame.
df1=pd.DataFrame(dict1)

In [18]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   Priyang@gmail.com
1   Aadhya    NaN  Female    Aadhya@gmail.com
2   Krisha   99.0  Female    Krisha@gmail.com
3   Vedant   87.0    Male    Vedant@yahoo.com
4   Parshv    NaN    Male  Parshv@hotmail.com
5   Mittal   83.0  Female    Mittal@yahoo.com
6  Archana   99.0  Female   Archana@yahoo.com

In [21]:
df1.head()

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   Priyang@gmail.com
1   Aadhya    NaN  Female    Aadhya@gmail.com
2   Krisha   99.0  Female    Krisha@gmail.com
3   Vedant   87.0    Male    Vedant@yahoo.com
4   Parshv    NaN    Male  Parshv@hotmail.com

In [22]:
df1.head(3)

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  Priyang@gmail.com
1   Aadhya    NaN  Female   Aadhya@gmail.com
2   Krisha   99.0  Female   Krisha@gmail.com

In [23]:
df1.tail()

      Name  Marks  Gender               Email
2   Krisha   99.0  Female    Krisha@gmail.com
3   Vedant   87.0    Male    Vedant@yahoo.com
4   Parshv    NaN    Male  Parshv@hotmail.com
5   Mittal   83.0  Female    Mittal@yahoo.com
6  Archana   99.0  Female   Archana@yahoo.com

In [24]:
df1.tail(3)

      Name  Marks  Gender               Email
4   Parshv    NaN    Male  Parshv@hotmail.com
5   Mittal   83.0  Female    Mittal@yahoo.com
6  Archana   99.0  Female   Archana@yahoo.com

In [25]:
df1.head(-2)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   Priyang@gmail.com
1   Aadhya    NaN  Female    Aadhya@gmail.com
2   Krisha   99.0  Female    Krisha@gmail.com
3   Vedant   87.0    Male    Vedant@yahoo.com
4   Parshv    NaN    Male  Parshv@hotmail.com

In [26]:
df1.tail(-2)

      Name  Marks  Gender               Email
2   Krisha   99.0  Female    Krisha@gmail.com
3   Vedant   87.0    Male    Vedant@yahoo.com
4   Parshv    NaN    Male  Parshv@hotmail.com
5   Mittal   83.0  Female    Mittal@yahoo.com
6  Archana   99.0  Female   Archana@yahoo.com

In [ ]:
#to find the shape of our data set

In [27]:
df1.shape

(7, 4)

In [28]:
df1.Marks.shape

(7,)

In [ ]:
#To get information about our dataset

In [30]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   5 non-null      float64
 2   Gender  7 non-null      object
 3   Email   7 non-null      object
dtypes: float64(1), object(3)
memory usage: 356.0+ bytes

In [ ]:
#To check null values in our data set

In [34]:
df1.isnull()

    Name  Marks  Gender  Email
0  False  False   False  False
1  False   True   False  False
2  False  False   False  False
3  False  False   False  False
4  False   True   False  False
5  False  False   False  False
6  False  False   False  False

In [35]:
df1.isnull().sum()

Name      0
Marks     2
Gender    0
Email     0
dtype: int64

In [ ]:
# To get overall statistics of our data set

In [36]:
df1.describe()

           Marks
count   5.000000
mean   93.200000
std     7.628892
min    83.000000
25%    87.000000
50%    98.000000
75%    99.000000
max    99.000000

In [37]:
df1.describe(include='all')

           Name      Marks  Gender              Email
count         7   5.000000       7                  7
unique        7        NaN       2                  7
top     Priyang        NaN  Female  Priyang@gmail.com
freq          1        NaN       4                  1
mean        NaN  93.200000     NaN                NaN
std         NaN   7.628892     NaN                NaN
min         NaN  83.000000     NaN                NaN
25%         NaN  87.000000     NaN                NaN
50%         NaN  98.000000     NaN                NaN
75%         NaN  99.000000     NaN                NaN
max         NaN  99.000000     NaN                NaN

In [ ]:
#To find the unique value from the gender column

In [39]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [40]:
df1['Gender']

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

In [42]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [43]:
df1['Marks'].unique()

array([98., nan, 99., 87., 83.])

In [44]:
df1['Gender'].nunique()

2

In [45]:
df1.nunique()

Name      7
Marks     4
Gender    2
Email     7
dtype: int64

In [ ]:
# To display count of unique values in gender column

In [46]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [ ]:
# handling missing values

In [47]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   Priyang@gmail.com
1   Aadhya    NaN  Female    Aadhya@gmail.com
2   Krisha   99.0  Female    Krisha@gmail.com
3   Vedant   87.0    Male    Vedant@yahoo.com
4   Parshv    NaN    Male  Parshv@hotmail.com
5   Mittal   83.0  Female    Mittal@yahoo.com
6  Archana   99.0  Female   Archana@yahoo.com

In [48]:
df1.dropna()

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  Priyang@gmail.com
2   Krisha   99.0  Female   Krisha@gmail.com
3   Vedant   87.0    Male   Vedant@yahoo.com
5   Mittal   83.0  Female   Mittal@yahoo.com
6  Archana   99.0  Female  Archana@yahoo.com

In [50]:
df1.dropna(how='all')

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   Priyang@gmail.com
1   Aadhya    NaN  Female    Aadhya@gmail.com
2   Krisha   99.0  Female    Krisha@gmail.com
3   Vedant   87.0    Male    Vedant@yahoo.com
4   Parshv    NaN    Male  Parshv@hotmail.com
5   Mittal   83.0  Female    Mittal@yahoo.com
6  Archana   99.0  Female   Archana@yahoo.com

In [51]:
df1.dropna(how='any')

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  Priyang@gmail.com
2   Krisha   99.0  Female   Krisha@gmail.com
3   Vedant   87.0    Male   Vedant@yahoo.com
5   Mittal   83.0  Female   Mittal@yahoo.com
6  Archana   99.0  Female  Archana@yahoo.com

In [53]:
df1.fillna(99)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   Priyang@gmail.com
1   Aadhya   99.0  Female    Aadhya@gmail.com
2   Krisha   99.0  Female    Krisha@gmail.com
3   Vedant   87.0    Male    Vedant@yahoo.com
4   Parshv   99.0    Male  Parshv@hotmail.com
5   Mittal   83.0  Female    Mittal@yahoo.com
6  Archana   99.0  Female   Archana@yahoo.com

In [55]:
df1['Marks'].fillna(df1['Marks'].mean())

0    98.0
1    93.2
2    99.0
3    87.0
4    93.2
5    83.0
6    99.0
Name: Marks, dtype: float64

In [58]:
df1['Marks']= df1['Marks'].fillna(df1['Marks'].mean())

In [59]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   Priyang@gmail.com
1   Aadhya   93.2  Female    Aadhya@gmail.com
2   Krisha   99.0  Female    Krisha@gmail.com
3   Vedant   87.0    Male    Vedant@yahoo.com
4   Parshv   93.2    Male  Parshv@hotmail.com
5   Mittal   83.0  Female    Mittal@yahoo.com
6  Archana   99.0  Female   Archana@yahoo.com

In [ ]:
# marks between 80 to 90

In [62]:
(df1['Marks']>=80) & (df1['Marks']<=90)

0    False
1    False
2    False
3     True
4    False
5     True
6    False
Name: Marks, dtype: bool

In [65]:
sum((df1['Marks']>=80) & (df1['Marks']<=90))

2

In [66]:
df1['Marks'].between(80,90)

0    False
1    False
2    False
3     True
4    False
5     True
6    False
Name: Marks, dtype: bool

In [67]:
sum(df1['Marks'].between(80,90))

2

In [ ]:
# Name of the students with lowest mark

In [68]:
df1['Marks'].min()

83.0

In [70]:
df1['Marks'].min()==df1['Marks']

0    False
1    False
2    False
3    False
4    False
5     True
6    False
Name: Marks, dtype: bool

In [71]:
df1[df1['Marks'].min()==df1['Marks']]

     Name  Marks  Gender             Email
5  Mittal   83.0  Female  Mittal@yahoo.com

In [72]:
df1[df1['Marks'].min()==df1['Marks']]['Name']

5    Mittal
Name: Name, dtype: object

In [ ]:
# top five students by their mark

In [73]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [75]:
df1['Marks']

0    98.0
1    93.2
2    99.0
3    87.0
4    93.2
5    83.0
6    99.0
Name: Marks, dtype: float64

In [77]:
df1.nlargest(5,'Marks')

      Name  Marks  Gender               Email
2   Krisha   99.0  Female    Krisha@gmail.com
6  Archana   99.0  Female   Archana@yahoo.com
0  Priyang   98.0    Male   Priyang@gmail.com
1   Aadhya   93.2  Female    Aadhya@gmail.com
4   Parshv   93.2    Male  Parshv@hotmail.com

In [82]:
df1.nlargest(5,'Marks')[['Name','Marks']]

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [83]:
df1['Marks'].max()

99.0

In [84]:
df1['Marks'].max()==df1['Marks']

0    False
1    False
2     True
3    False
4    False
5    False
6     True
Name: Marks, dtype: bool

In [89]:
df1[df1['Marks'].max()==df1['Marks']]

      Name  Marks  Gender              Email
2   Krisha   99.0  Female   Krisha@gmail.com
6  Archana   99.0  Female  Archana@yahoo.com

In [92]:
df1[df1['Marks'].max()==df1['Marks']]['Name']

2     Krisha
6    Archana
Name: Name, dtype: object

In [93]:
df1.sort_values(by='Marks',ascending=False).head()

      Name  Marks  Gender               Email
2   Krisha   99.0  Female    Krisha@gmail.com
6  Archana   99.0  Female   Archana@yahoo.com
0  Priyang   98.0    Male   Priyang@gmail.com
1   Aadhya   93.2  Female    Aadhya@gmail.com
4   Parshv   93.2    Male  Parshv@hotmail.com

In [95]:
df1.sort_values(by='Marks',ascending=False).head()[['Name','Marks']]

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [ ]:
#find average marks

In [96]:
df1['Marks'].mean()

93.2

In [97]:
df1['Marks'].max()

99.0

In [98]:
df1['Marks'].min()

83.0

In [99]:
# Apply method

In [100]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   Priyang@gmail.com
1   Aadhya   93.2  Female    Aadhya@gmail.com
2   Krisha   99.0  Female    Krisha@gmail.com
3   Vedant   87.0    Male    Vedant@yahoo.com
4   Parshv   93.2    Male  Parshv@hotmail.com
5   Mittal   83.0  Female    Mittal@yahoo.com
6  Archana   99.0  Female   Archana@yahoo.com

In [101]:
def marks(x):return x/2

In [102]:
df1['Marks'].apply(marks)

0    49.0
1    46.6
2    49.5
3    43.5
4    46.6
5    41.5
6    49.5
Name: Marks, dtype: float64

In [103]:
df1['half_marks']=df1['Marks'].apply(marks)

In [104]:
df1

      Name  Marks  Gender               Email  half_marks
0  Priyang   98.0    Male   Priyang@gmail.com        49.0
1   Aadhya   93.2  Female    Aadhya@gmail.com        46.6
2   Krisha   99.0  Female    Krisha@gmail.com        49.5
3   Vedant   87.0    Male    Vedant@yahoo.com        43.5
4   Parshv   93.2    Male  Parshv@hotmail.com        46.6
5   Mittal   83.0  Female    Mittal@yahoo.com        41.5
6  Archana   99.0  Female   Archana@yahoo.com        49.5

In [105]:
#Map function

In [106]:
df1

      Name  Marks  Gender               Email  half_marks
0  Priyang   98.0    Male   Priyang@gmail.com        49.0
1   Aadhya   93.2  Female    Aadhya@gmail.com        46.6
2   Krisha   99.0  Female    Krisha@gmail.com        49.5
3   Vedant   87.0    Male    Vedant@yahoo.com        43.5
4   Parshv   93.2    Male  Parshv@hotmail.com        46.6
5   Mittal   83.0  Female    Mittal@yahoo.com        41.5
6  Archana   99.0  Female   Archana@yahoo.com        49.5

In [108]:
df1['Gender'].map({'Male':1,'Female':2})

0    1
1    2
2    2
3    1
4    1
5    2
6    2
Name: Gender, dtype: int64

In [109]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':2})

In [110]:
df1

      Name  Marks  Gender               Email  half_marks  Male_Female
0  Priyang   98.0    Male   Priyang@gmail.com        49.0            1
1   Aadhya   93.2  Female    Aadhya@gmail.com        46.6            2
2   Krisha   99.0  Female    Krisha@gmail.com        49.5            2
3   Vedant   87.0    Male    Vedant@yahoo.com        43.5            1
4   Parshv   93.2    Male  Parshv@hotmail.com        46.6            1
5   Mittal   83.0  Female    Mittal@yahoo.com        41.5            2
6  Archana   99.0  Female   Archana@yahoo.com        49.5            2

In [111]:
df1.drop('Male_Female',axis=1)

      Name  Marks  Gender               Email  half_marks
0  Priyang   98.0    Male   Priyang@gmail.com        49.0
1   Aadhya   93.2  Female    Aadhya@gmail.com        46.6
2   Krisha   99.0  Female    Krisha@gmail.com        49.5
3   Vedant   87.0    Male    Vedant@yahoo.com        43.5
4   Parshv   93.2    Male  Parshv@hotmail.com        46.6
5   Mittal   83.0  Female    Mittal@yahoo.com        41.5
6  Archana   99.0  Female   Archana@yahoo.com        49.5

In [112]:
#inplace

In [113]:
df1.drop('Male_Female',axis=1,inplace=True)

In [114]:
df1

      Name  Marks  Gender               Email  half_marks
0  Priyang   98.0    Male   Priyang@gmail.com        49.0
1   Aadhya   93.2  Female    Aadhya@gmail.com        46.6
2   Krisha   99.0  Female    Krisha@gmail.com        49.5
3   Vedant   87.0    Male    Vedant@yahoo.com        43.5
4   Parshv   93.2    Male  Parshv@hotmail.com        46.6
5   Mittal   83.0  Female    Mittal@yahoo.com        41.5
6  Archana   99.0  Female   Archana@yahoo.com        49.5

In [115]:
df1.sort_values(by='Marks')

      Name  Marks  Gender               Email  half_marks
5   Mittal   83.0  Female    Mittal@yahoo.com        41.5
3   Vedant   87.0    Male    Vedant@yahoo.com        43.5
1   Aadhya   93.2  Female    Aadhya@gmail.com        46.6
4   Parshv   93.2    Male  Parshv@hotmail.com        46.6
0  Priyang   98.0    Male   Priyang@gmail.com        49.0
2   Krisha   99.0  Female    Krisha@gmail.com        49.5
6  Archana   99.0  Female   Archana@yahoo.com        49.5

In [126]:
#by descending order
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender               Email  half_marks
2   Krisha   99.0  Female    Krisha@gmail.com        49.5
6  Archana   99.0  Female   Archana@yahoo.com        49.5
0  Priyang   98.0    Male   Priyang@gmail.com        49.0
1   Aadhya   93.2  Female    Aadhya@gmail.com        46.6
4   Parshv   93.2    Male  Parshv@hotmail.com        46.6
3   Vedant   87.0    Male    Vedant@yahoo.com        43.5
5   Mittal   83.0  Female    Mittal@yahoo.com        41.5

In [127]:
#Display Name and Marks of the female students

In [132]:
df1['Gender']=='Female'

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [133]:
df1[df1['Gender']=='Female']

      Name  Marks  Gender              Email  half_marks
1   Aadhya   93.2  Female   Aadhya@gmail.com        46.6
2   Krisha   99.0  Female   Krisha@gmail.com        49.5
5   Mittal   83.0  Female   Mittal@yahoo.com        41.5
6  Archana   99.0  Female  Archana@yahoo.com        49.5

In [135]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya   93.2
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

In [137]:
df1['Gender'].isin(['Female'])

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [139]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya   93.2
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

In [140]:
#Rename the marks columns

In [141]:
df1.rename(columns={'Marks':"Final_Marks"})

      Name  Final_Marks  Gender               Email  half_marks
0  Priyang         98.0    Male   Priyang@gmail.com        49.0
1   Aadhya         93.2  Female    Aadhya@gmail.com        46.6
2   Krisha         99.0  Female    Krisha@gmail.com        49.5
3   Vedant         87.0    Male    Vedant@yahoo.com        43.5
4   Parshv         93.2    Male  Parshv@hotmail.com        46.6
5   Mittal         83.0  Female    Mittal@yahoo.com        41.5
6  Archana         99.0  Female   Archana@yahoo.com        49.5

In [156]:
df1['Marks']+df1['Marks']

0    196.0
1    186.4
2    198.0
3    174.0
4    186.4
5    166.0
6    198.0
Name: Marks, dtype: float64